Revit 2027 API
DatumPlane.GetPropagationViews Method
 Gets a list of candidate views which are parallel to the current view and to which the extents of the datum may be propagated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetPropagationViews(
	View view
)
Public Function GetPropagationViews (
	view As View
) As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetPropagationViews(
	View^ view
)
member GetPropagationViews :
        view : View -> ISet<ElementId>
Parameters
view View
 The view on which the DatumPlane shows.
Return Value
ISet<ElementId>
 A set of ElementIds of the parallel views for extent propagation.
Exceptions
Exception | Condition
ArgumentException |  The datum plane cannot be visible in the view.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace